In [1]:
import numpy as np
from pandas import Series, DataFrame
import pandas as pd
from numpy.random import randn

In [2]:
ser1 = Series([1,2,3,4], index = ['A', 'B', 'C', 'D'])
ser1

A    1
B    2
C    3
D    4
dtype: int64

In [3]:
ser2 = ser1.reindex(['A', 'B', 'C', 'D', 'E', 'F'])
ser2

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
dtype: float64

In [4]:
ser2['F']

nan

In [7]:
ser2.reindex(['A', 'B', 'C', 'D', 'E', 'F', 'G'], fill_value = 0)

A    1.0
B    2.0
C    3.0
D    4.0
E    NaN
F    NaN
G    0.0
dtype: float64

In [10]:
ser3 = Series(['USA', 'Mexico', 'Canada'], index = [0,5,10])

In [11]:
ser3

0        USA
5     Mexico
10    Canada
dtype: object

In [12]:
ranger = range(15)
ranger

range(0, 15)

In [14]:
ser3.reindex(ranger, method = 'ffill')

0        USA
1        USA
2        USA
3        USA
4        USA
5     Mexico
6     Mexico
7     Mexico
8     Mexico
9     Mexico
10    Canada
11    Canada
12    Canada
13    Canada
14    Canada
dtype: object

In [15]:
dframe = DataFrame(randn(25).reshape((5,5)), index = ['A', 'B', 'D', 'E', 'F'], 
                   columns = ['col1', 'col2', 'col3', 'col4', 'col5'])
dframe

       col1      col2      col3      col4      col5
A  0.736626  0.119934  0.685335 -1.868060  0.140929
B  1.029858 -0.013264  0.866349  0.486260  0.006239
D -1.527402 -0.489929  0.098119  0.064247 -0.042508
E -0.630764  0.320387 -1.544617  0.422718 -0.040731
F -0.780560  1.290484  0.628960  0.492080 -0.428921

In [16]:
dframe2 = dframe.reindex(['A', 'B', 'C', 'D', 'E', 'F'])

In [17]:
dframe2

       col1      col2      col3      col4      col5
A  0.736626  0.119934  0.685335 -1.868060  0.140929
B  1.029858 -0.013264  0.866349  0.486260  0.006239
C       NaN       NaN       NaN       NaN       NaN
D -1.527402 -0.489929  0.098119  0.064247 -0.042508
E -0.630764  0.320387 -1.544617  0.422718 -0.040731
F -0.780560  1.290484  0.628960  0.492080 -0.428921

In [18]:
new_columns = ['col1', 'col2', 'col3', 'col4', 'col5', 'col6']

In [19]:
dframe2.reindex(columns = new_columns)

       col1      col2      col3      col4      col5  col6
A  0.736626  0.119934  0.685335 -1.868060  0.140929   NaN
B  1.029858 -0.013264  0.866349  0.486260  0.006239   NaN
C       NaN       NaN       NaN       NaN       NaN   NaN
D -1.527402 -0.489929  0.098119  0.064247 -0.042508   NaN
E -0.630764  0.320387 -1.544617  0.422718 -0.040731   NaN
F -0.780560  1.290484  0.628960  0.492080 -0.428921   NaN

In [20]:
dframe

       col1      col2      col3      col4      col5
A  0.736626  0.119934  0.685335 -1.868060  0.140929
B  1.029858 -0.013264  0.866349  0.486260  0.006239
D -1.527402 -0.489929  0.098119  0.064247 -0.042508
E -0.630764  0.320387 -1.544617  0.422718 -0.040731
F -0.780560  1.290484  0.628960  0.492080 -0.428921

In [29]:
# dframe.ix[['A', 'B', 'C', 'D', 'E', 'F'], new_columns]
# .ix is a deprecated method

In [35]:
ser3 = dframe2.iloc[0]